Revit 2027 API
KeyBasedTreeEntriesLoadContent.BuildEntries Method
 Builds a KeyBasedTreeEntries object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void BuildEntries()
Public Sub BuildEntries
public:
void BuildEntries()
member BuildEntries : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException |  The KeyBasedTreeEntries object owned by this KeyBasedTreeEntriesLoadContent object is built already. Adding more KeyBasedTreeEntries as well as repeated building, is not supported.
Remarks
 This method will take all the entries that have been added, create a KeyBasedTreeEntries object out of these entries, and also record possible errors that occurred while constructing this KeyBasedTreeEntries object. After this function is called, no more entries can be added. And repeated calling of this function is not allowed either.
See Also
Reference
KeyBasedTreeEntriesLoadContent Class
Autodesk.Revit.DB Namespace